//
//  Category.swift
//  AliasGame
//
//  Created by Андрей Кузнецов on 29.07.2022.
//

import Foundation

struct Category {
    let title: String
    let words: [String]
    let secondaryWords: [String]
}

extension Category {
    
    static let Categories: [Category] =  [
        Category(title: "Музыка",
                 words: ["музыка", "песня", "клип", "компакт-диск", "гитара", "струна", "нота", "голос", "композиция", "аккомпонимент", "дерижер", "оркестр", "консерватория", "камертон", "музыковед", "кселофон", "медиатор", "припев", "куплет", "тональность", "мажер", "минор", "продюсер", "лейбел", "грамм-пластинка", "винил", "фонотека", "звуки му"],
                 secondaryWords: []),
        
        Category(title: "Сладости",
                 words: ["шоколад", "каромель", "вафля", "фантик", "бомбоньерка", "трюфель", "патока", "какао-боб", "ореховая масса", "кондитерская", "шоколадье", "пролене", "глазурь", "фандю", "орехи", "пастила", "зефир", "курога", "чернослив", "купаж", "ганаш"],
                 secondaryWords: []),
        
        Category(title: "Транспорт",
                 words: ["машина", "самокат", "колесо", "поршень", "мотор", "пассажир", "машинист", "электропоезд", "центральное кольцо", "ремень безопасности", "автовокзал", "патруль", "светофор", "автомастерская", "механик"],
                 secondaryWords: []),
        
        Category(title: "Спорт",
                 words: ["нападающий", "болельщик", "тренер", "гонтеля", "ракетка", "арена", "чемпионат", "тайм-аут", "супервайзер", "гимнаст", "бутцы", "раунд", "бейсболл", "спортивная ходьба", "сноуборд"],
                 secondaryWords: [])
    ]
}
